Revit 2026 API

# ParameterTypeIdBoundaryLinearRestraintRotX Property

---

"X Spring Modulus"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId BoundaryLinearRestraintRotX { get; }
```
```vb
Public Shared ReadOnly Property BoundaryLinearRestraintRotX As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ BoundaryLinearRestraintRotX {
	ForgeTypeId^ get ();
}
```
```fsharp
static member BoundaryLinearRestraintRotX : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace